       01 PROFILE-RECORD.
           05 PROFILE-ID         PIC X(10).
           05 PROFILE-FN         PIC X(30).
           05 PROFILE-LN         PIC X(30).
           05 PROFILE-CREATE-AT  PIC X(50).
           05 PROFILE-USER-ID    PIC X(10).
           05 FILLER             PIC X(10).
