       01  USER-RECORD.
           05  USER-ID         PIC X(10).
           05  USER-USERNAME   PIC X(30).
           05  USER-EMAIL      PIC X(30).
           05  USER-PWD        PIC X(64).
           05  USER-CREATE-AT  PIC X(50).
           05  FILLER          PIC X(10).
