      *> ----------------------------------------------------------------
      *> Author: imlostish
      *> Date:   13/07/2025
      *> Purpose: self-learning
      *> License: MIT
      *> PLEASE GIVE ME A JOB
      *> ----------------------------------------------------------------
       identification division.
       program-id. BLM-CC-CONTROLLER.
       environment division.
       configuration section.
         input-output section.
       data division.
       working-storage  section.
       linkage section.
       file section.
       procedure division.

           display "blm credit card controller"

       stop run.
       end program BLM-CC-CONTROLLER.