      *> ----------------------------------------------------------------
      *> Author: imlostish
      *> Date:   13/07/2025
      *> Purpose: self-learning
      *> License: MIT
      *> PLEASE GIVE ME A JOB
      *> ----------------------------------------------------------------
       IDENTIFICATION DIVISION.
       PROGRAM-ID. BLM-PROFILE-CONTROLLER.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY '../entities/profile.cpy'.
       PROCEDURE DIVISION.

           DISPLAY "blm profile controller"

       STOP RUN.
       END PROGRAM BLM-PROFILE-CONTROLLER.
