       01 PROFMD-RECORD.
           05 PROFMD-ID         PIC X(10).
           05 PROFMD-ADDRESS    PIC X(40).
           05 PROFMD-CITY       PIC X(10).
           05 PROFMD-COUNTRY    PIC X(10).
           05 PROFMD-PC         PIC X(10).
           05 PROFMD-CREATE-AT  PIC X(50).
           05 PROFMD-PROFILE-ID PIC X(10).
