*> -------------------------------------------------
*> Name: register-data.cpy
*> Description: Register Data Structure
*> -------------------------------------------------
01 REGISTER-DATA.
    05 RD-USERNAME  PIC X(64)  VALUE SPACES.
    05 RD-EMAIL     PIC X(124) VALUE SPACES.
    05 RD-PWD       PIC X(64)  VALUE SPACES.